# YOLO26-Hybrid v2 — improved architecture for Gram-stain bacteria detection
# Changes vs v1:
#   1. Removed end2end / reg_max  → standard NMS Detect (fixes training instability)
#   2. SPPF [1024,5] standard     → removes non-standard extended receptive field
#   3. Top-down neck C3k2 False   → reduces decoder capacity (layers 13, 16)
#   4. P2 block e=0.25            → halves internal channels, less overfitting
#   5. P3 refined: added CBAM     → spatial+channel attention for bacterial focus
#   6. P5 neck C3k2 standard      → removes unstable [True, 0.5, True] args
#   7. Detect includes P2         → 4-scale detection [P2, P3, P4, P5]
#   Expected: mAP50 >= 0.931, stable training, no overfitting after epoch 100

nc: 4
scale: n
end2end: True
reg_max: 16

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 2, C3k2, [512, True]]           # 6
  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9  CHANGED: standard (was [1024,5,3,True])
  - [-1, 2, C2PSA, [1024]]               # 10

head:
  # top-down P5->P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 2, C3k2, [512, False]]                 # 13  CHANGED: True->False

  # top-down P4->P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15
  - [-1, 2, C3k2, [256, False]]                 # 16  CHANGED: True->False

  # top-down P3->P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 1], 1, Concat, [1]]                   # 18

  # P2 shallow block, e=0.25 halves internal channels
  - [-1, 1, C3k2, [128, False, 0.25]]           # 19 P2  CHANGED: added e=0.25

  # bottom-up P2->P3
  - [-1, 1, Conv, [128, 3, 2]]                  # 20
  - [[-1, 16], 1, Concat, [1]]                  # 21
  - [-1, 1, C3k2, [256, False]]                 # 22 P3 refined  CHANGED: True->False

  # NEW: CBAM attention on P3 refined
  - [-1, 1, CBAM, [64]]                         # 23  NEW

  # bottom-up P3->P4
  - [-1, 1, Conv, [256, 3, 2]]                  # 24
  - [[-1, 13], 1, Concat, [1]]                  # 25
  - [-1, 2, C3k2, [512, False]]                 # 26 P4  CHANGED: True->False

  # bottom-up P4->P5
  - [-1, 1, Conv, [512, 3, 2]]                  # 27
  - [[-1, 10], 1, Concat, [1]]                  # 28
  - [-1, 1, C3k2, [1024, False]]                # 29 P5  CHANGED: removed [True,0.5,True]

  # Detect: 4 scales P2+P3+P4+P5
  - [[19, 23, 26, 29], 1, Detect, [nc]]
