# YOLO26 bacteria P2 precision-focused
nc: 4
end2end: True
reg_max: 1
scale: n

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]]
  - [-1, 2, C2PSA, [1024]]

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 2, C3k2, [512, True]]                  # 13

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15
  - [-1, 2, C3k2, [256, True]]                  # 16

  # P3 -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17
  - [[-1, 1], 1, Concat, [1]]                   # 18

  # precision-focused P2: shallow, less noisy
  - [-1, 1, C3k2, [128, False]]                 # 19 P2

  # P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]                  # 20
  - [[-1, 16], 1, Concat, [1]]                  # 21
  - [-1, 1, C3k2, [256, True]]                  # 22 P3 refined, less aggressive than repeats=2

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                  # 23
  - [[-1, 13], 1, Concat, [1]]                  # 24
  - [-1, 2, C3k2, [512, True]]                  # 25 P4

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]                  # 26
  - [[-1, 10], 1, Concat, [1]]                  # 27
  - [-1, 1, C3k2, [1024, True, 0.5, True]]      # 28 P5

  - [[22, 25, 28], 1, Detect, [nc]]